const char YY_trafficLight[][32] = {/*const修饰的变量也是常量, 不可修改*/
	"错误",
	"红色",
	"绿色",
	"黄色"
};

const char Debug[][32] = {
	"退出",		/*0*/
	"收到",		/*1*/
	"错误",		/*2*/
	"二维码",	/*3*/
	"交通灯",	/*4*/
	"发送",		/*5*/
	"识别成功",	/*6*/
	"识别完成"  /*7*/
};

const char Length_Unit[][32] = {
	"厘米",		/* 0 */
	"毫米",		/* 1 */
   	"百",       /* 2 */
	"十"       /* 3*/


};
const char str[][32] = {

	"美好生活", /*0*/

"秀丽山河", /*1*/

"追逐梦想", /*2*/

"扬帆启航", /*3*/

"齐头并进", /*4*/

"向右转弯", /*5*/

"禁止右转", /*6*/

"左侧行驶", /*7*/

"左行被禁", /*8*/

"原地掉头", /*9*/

"无命令ID",	/*10*/

"用户静音超时", /*11*/

"用户语音超时", /*12*/

"识别拒识", /*13*/

"识别内部错误", /*14*/

"识别错误", /*15*/

"禁止左转",	/*16*/

"前方道路不通右转弯",/* 17*/

"富强路站",	/*18*/
"民主路站",	/*19*/
"文明路站",	/*20*/
"和谐路站",	/*21*/
"爱国路站",	/*22*/
"敬业路站",	/*23*/
"友善路站",	/*24*/

"民主路到了",/*25*/
"文明路到了",/*26*/
"和谐路到了",/*27*/

};


const char stereo[][3] = {

"奋", /*0*/

"进", /*1*/

"新", /*2*/

"征", /*3*/

"程", /*4*/

"美",/*5*/

"美", /*6*/

"丽", /*7*/

"中", /*8*/

"国",/*9*/

"美",/*10*/

"美", /*11*/

"美", /*12*/

"美", /*13*/

"美", /*14*/

"美", /*15*/

"美", /*16*/

"美", /*17*/
};

const char CA[3] = "";
const char CB[3] = "";
const char CC[3] = "";
const char CF[3] = "";
const char CG[3] = "";





const char n[5] = "年";
const char y[5] = "月";
const char r[5] = "日";
const char s[5] = "时";
const char f[5] = "分";
const char m[5] = "秒";


const char luden[20] = "路灯的初始挡位为";
const char ludenmb[20] = "路灯的目标挡位为";
const char dan[10] = " 挡 ";

const char chede[10] = "测得为 ";

const char t1[10] = "富强路站";
const char t2[10] = "民主路站";
const char t3[10] = "文明路站";
const char t4[10] = "和谐路站";
const char t5[10] = "爱国路站";
const char t6[10] = "敬业路站";
const char t7[10] = "友善路站";

const char bai[3] = "百";
const char shi[3] = "十";
const char ge[3] = "个";

const char limi[5] = "厘米";
const char haomi[5] = "毫米";

const char DX[20] = "地形状态为A到B";
const char DX_1[20] = "地形状态为B到A";












